const banks = {
  "郑艳军语录": [{
  text: "【重点】伟大领袖郑艳军同志曾经说过____。",
    ans: "做人不要活得太通透",
    opts: ["原电池中，电子由负极经外电路流向正极。", "刘刚积攒正能量", "每天说完学生都特别爽", "做人不要活得太通透"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【概念】下列用语形容郑艳军同志的是______。",
    ans: "热量的耗（二声）散",
    opts: ["可惜不是你，陪我到最后", "觉醒30000", "枪挑紫金冠", "热量的耗（二声）散"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】郑艳军曾经说过____，有效的指导了我们的学习生活。",
    ans: "如果你一不小心考上了大学，我奉劝你，最好提前准备四六级",
    opts: ["一分都不给你", "我有四不吃，一：地大附中食堂我不吃", "班会888", "如果你一不小心考上了大学，我奉劝你，最好提前准备四六级"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【概念】郑艳军曾经说过了一句很有哲理的话：_____",
    ans: "你会收益终生的",
    opts: ["没吃过猪还没见过猪跑？", "你会受益终生的", "黄老师你是教历史的吧", "TCL"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】下列是郑艳军同志所说的，且说法正确的是：____。",
    ans: "这是刘刚老师弄的，他就是个大废物",
    opts: ["这是刘刚老师弄的，他就是个大废物", "我不扶烂泥，我不翻咸鱼，我不对牛弹琴", "仓鼠？仓鼠是谁啊？", "这是角速度的公式：Δs比上一个t"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】下列短语与郑艳军同志相关的是____。",
    ans: "这纸不臭啊",
    opts: ["0.5 mol", "烂泥、咸鱼和牛", "这纸不臭啊", "Sep1st"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】以下语句是郑艳军所说过的是____。",
    ans: "温馨提示：订餐",
    opts: ["温馨提示：订餐", "38324", "明日听写：alphabet至amusement", "奇变偶不变"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】以下语句是郑艳军所说过的是____。",
    ans: "找我面试",
    opts: ["找我面试", "你的期中目标是什么", "我要赶紧去赶15号线去了", "小米同学"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【大场面】郑艳军在批评学生时的经典口头禅是____。",
    ans: "你算什么东西",
    opts: ["跟我读c ai~ 菜！", "这个选项唯心了", "你算什么东西", "你们的英语要飞黄腾达了"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经典】郑艳军经常说的口头禅是____。",
    ans: "你怎么活得这么拧巴",
    opts: ["你有毛病吧", "清学葱姜蒜", "你怎么活得这么拧巴", "董欣璇爱吃虾"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别咳嗽",
    opts: ["别咳嗽", "别算数", "别睡觉", "别骂人"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别喝水",
    opts: ["别上厕所", "别喝水", "别写作业", "别做眼保健操"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别带情绪",
    opts: ["别带情绪", "别睡觉", "别不学习", "别写物理作业"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别太有个性",
    opts: ["别顶嘴", "别说话", "别太有个性", "别骂刘刚老师"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经问过？",
    ans: "你是不是对我有意见",
    opts: ["上的是正经小学吗", "你是不是对我有意见", "仓鼠？仓鼠是谁？", "同学你的期末目标是什么"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【语录】郑艳军老师曾经问过？",
    ans: "课代表呢？",
    opts: ["课代表呢？", "幼儿园直升高中？", "刘刚是个大废物", "跑操什么时候结束"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【语录】郑艳军老师曾经问过？",
    ans: "你算哪根葱？",
    opts: ["同学你的期末目标一天念多少遍", "没吃过猪还没见过猪跑？", "你算哪根葱？", "以上都不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "对我有威胁",
    opts: ["对我有威胁", "厕所有股味", "说学生很爽", "长跑拉风箱"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语录】郑艳军老师曾经诊断出了：",
    ans: "刘馨桐脑子不好",
    opts: ["张奥博脑子不好", "刘馨桐脑子不好", "张启太脑子不好", "自己脑子不好"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【捡史】郑艳军老师开学时写过哪四个字？",
    ans: "永远1班",
    opts: ["天下为公", "永远1班", "我缺钱了", "开学快乐"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【名言】郑艳军老师曾经说过哪一句名言？",
    ans: "注意力不集中是精神分裂前兆",
    opts: ["实践是检验真理的唯一标准", "注意力不集中是精神分裂前兆", "我缺钱了，v我五十", "同学们你们的紫金冠歪了"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【名言】郑艳军老师曾经说过哪一句名言？",
    ans: "做眼保健操！",
    opts: ["狗熊哆嗦毛", "做物理作业！", "做眼保健操！", "我最爱我的电动牙刷了"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }],
  "郑艳军经历": [{
    text: "【经历】郑艳军老师说自己数学哪块一直想不明白，高考都没考好？",
    ans: "立体几何",
    opts: ["圆", "立体几何", "积分", "郑艳军是神，没有不会的"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师曾经说过哪首歌让他印象深刻，甚至在课堂上被提及？",
    ans: "月亮代表我的心",
    opts: ["可惜不是你", "父亲的草原母亲的河", "月亮代表我的心", "地大附中校歌"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【常识】郑艳军老师的出生年月日是？",
    ans: "19720910",
    opts: ["19720910", "19780817", "88888882", "20250901"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师的故乡是___。",
    ans: "内蒙古",
    opts: ["青海", "内蒙古", "日本东京市", "北京市海淀区"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师的文件夹、文件时经常加的后缀是____。",
    ans: "88888882",
    opts: ["高二一班", "不加", "88888882", "积攒正能量"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师在大学时期拿到了什么证书，曾经向我们提及？",
    ans: "计算机二级",
    opts: ["计算机二级", "四六级", "教师资格证", "研究生考试"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师的日常用两个字形容是。",
    ans: "拧巴",
    opts: ["糊涂", "通透", "现实", "拧巴"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师与刘刚老师的关系相当于：____",
    ans: "邵新宇老师和贾洁晶老师",
    opts: ["邵新宇老师和贾洁晶老师", "董欣璇老师和王鹤老师", "罗长文老师和洪世松老师", "康沐垚同学和习近平主席"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师念「耗散」这个词时，经典的错误读音是____声。",
    ans: "二",
    opts: ["一", "二", "三", "四"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "红薯味的屁",
    opts: ["刘刚教必胜", "红薯味的屁", "38324", "董欣璇回归"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "都不是",
    opts: ["洞洞幺", "呆呆", "都不是", "亡蜂大汉奸"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "别太有个性",
    opts: ["习近平宿敌", "农大高材生", "戒烟防草包", "别太有个性"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经历】郑艳军老师经常对___发号施令：___",
    ans: "陈镜轩；开窗通风",
    opts: ["陈镜轩；开窗通风", "康沐垚；剪头发", "于凯丞；擦黑板", "食堂小孩；别说话"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经历】郑艳军老师经常对___发号施令：___",
    ans: "孟柯；拿手机",
    opts: ["张奥博；别喝水", "孟柯；拿手机", "李庚鉴；别拧巴", "刘刚；别往仪器上涂油"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师经常对___发号施令：___",
    ans: "康沐垚；别发表意见",
    opts: ["康沐垚；别发表意见", "刘泽宏；别抖腿", "董欣璇；别吃虾", "王鹤；别骂人"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师曾经参与了：",
    ans: "电动牙刷事件",
    opts: ["文化大革命", "电动牙刷事件", "郑艳军刺秦王", "觉醒3000贴吧吧主身份被撤除"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师曾经参与了：",
    ans: "261012食堂被骂事件",
    opts: ["国民党的建立", "刺杀肯尼迪", "261012食堂被骂事件", "化学科目的教学"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师曾经参与了：",
    ans: "物理学科的教学",
    opts: ["物理学科的教学", "日本首相的任职", "通透教育的贯彻", "以上均不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【捡史】郑艳军老师在2026年10月12日被谁辱骂了",
    ans: "食堂小孩",
    opts: ["食堂小孩", "安倍晋三", "董欣璇", "物理组组长"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }],
  "郑艳军管理下的生存方法论": [{
    text: "【生存法则】上郑艳军老师的课，谁更有可能被针对？",
    ans: "都有可能",
    opts: ["聊天的张奥博同学", "听课的刘刚老师", "睡觉的李庚鉴同学", "都有可能"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【生存法则】如果郑艳军老师在班里抽风，最安全的做法是____。",
    ans: "写作业，只要不给我处分都是在调情",
    opts: ["立刻反驳解释", "写作业，只要不给我处分都是在调情", "偷偷和同学骂他神经病", "收拾书包准备走"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【生存法则】要在郑艳军老师面前做到什么____。",
    ans: "别抱怨",
    opts: ["鸟都不鸟，直接走开", "背“1101081972”开头的数字", "别抱怨", "念叨《刚教》相关内容"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【生存法则】郑艳军老师最喜欢的值日步骤是____。",
    ans: "往地上泼水洗地",
    opts: ["拿砂纸搓墙", "把黑板擦成白板", "把三氯异氰尿酸钠消毒片扔进水盆", "往地上泼水洗地"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【常识】郑艳军老师在周几有区教研",
    ans: "周三",
    opts: ["周一", "周三", "周五", "周日"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【推理】高二1班同学在周几可以按时放学？",
    ans: "周三",
    opts: ["周一", "周三", "周五", "周日"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }]
};
const supplementaryOriginal = [
  {
    text: "【生存法则】上郑艳军老师的课，谁更有可能被针对？",
    ans: "都有可能",
    opts: ["聊天的张奥博同学", "听课的刘刚老师", "睡觉的李庚鉴同学", "都有可能"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【生存法则】如果郑艳军老师在班里抽风，最安全的做法是____。",
    ans: "写作业，只要不给我处分都是在调情",
    opts: ["立刻反驳解释", "写作业，只要不给我处分都是在调情", "偷偷和同学骂他神经病", "收拾书包准备走"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【生存法则】要在郑艳军老师面前做到什么____。",
    ans: "别抱怨",
    opts: ["鸟都不鸟，直接走开", "背“1101081972”开头的数字", "别抱怨", "念叨《刚教》相关内容"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【生存法则】郑艳军老师最喜欢的值日步骤是____。",
    ans: "往地上泼水洗地",
    opts: ["拿砂纸搓墙", "把黑板擦成白板", "把三氯异氰尿酸钠消毒片扔进水盆", "往地上泼水洗地"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
  text: "【重点】伟大领袖郑艳军同志曾经说过____。",
    ans: "做人不要活得太通透",
    opts: ["原电池中，电子由负极经外电路流向正极。", "刘刚积攒正能量", "每天说完学生都特别爽", "做人不要活得太通透"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【概念】下列用语形容郑艳军同志的是______。",
    ans: "热量的耗（二声）散",
    opts: ["可惜不是你，陪我到最后", "觉醒30000", "枪挑紫金冠", "热量的耗（二声）散"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】郑艳军曾经说过____，有效的指导了我们的学习生活。",
    ans: "如果你一不小心考上了大学，我奉劝你，最好提前准备四六级",
    opts: ["一分都不给你", "我有四不吃，一：地大附中食堂我不吃", "班会888", "如果你一不小心考上了大学，我奉劝你，最好提前准备四六级"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【概念】郑艳军曾经说过了一句很有哲理的话：_____",
    ans: "你会收益终生的",
    opts: ["没吃过猪还没见过猪跑？", "你会受益终生的", "黄老师你是教历史的吧", "TCL"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】下列是郑艳军同志所说的，且说法正确的是：____。",
    ans: "这是刘刚老师弄的，他就是个大废物",
    opts: ["这是刘刚老师弄的，他就是个大废物", "我不扶烂泥，我不翻咸鱼，我不对牛弹琴", "仓鼠？仓鼠是谁啊？", "这是角速度的公式：Δs比上一个t"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】下列短语与郑艳军同志相关的是____。",
    ans: "这纸不臭啊",
    opts: ["0.5 mol", "烂泥、咸鱼和牛", "这纸不臭啊", "Sep1st"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】以下语句是郑艳军所说过的是____。",
    ans: "温馨提示：订餐",
    opts: ["温馨提示：订餐", "38324", "明日听写：alphabet至amusement", "奇变偶不变"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【重点】以下语句是郑艳军所说过的是____。",
    ans: "找我面试",
    opts: ["找我面试", "你的期中目标是什么", "我要赶紧去赶15号线去了", "小米同学"],
    type: "choice",
    source: "练习册：郑艳军.pdf"
  }, {
  text: "【大场面】郑艳军在批评学生时的经典口头禅是____。",
    ans: "你算什么东西",
    opts: ["跟我读c ai~ 菜！", "这个选项唯心了", "你算什么东西", "你们的英语要飞黄腾达了"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经典】郑艳军经常说的口头禅是____。",
    ans: "你怎么活得这么拧巴",
    opts: ["你有毛病吧", "清学葱姜蒜", "你怎么活得这么拧巴", "董欣璇爱吃虾"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师说自己数学哪块一直想不明白，高考都没考好？",
    ans: "立体几何",
    opts: ["圆", "立体几何", "积分", "郑艳军是神，没有不会的"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师曾经说过哪首歌让他印象深刻，甚至在课堂上被提及？",
    ans: "月亮代表我的心",
    opts: ["可惜不是你", "父亲的草原母亲的河", "月亮代表我的心", "地大附中校歌"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【常识】郑艳军老师的出生年月日是？",
    ans: "19720910",
    opts: ["19720910", "19780817", "88888882", "20250901"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师的故乡是___。",
    ans: "内蒙古",
    opts: ["青海", "内蒙古", "日本东京市", "北京市海淀区"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师的文件夹、文件时经常加的后缀是____。",
    ans: "88888882",
    opts: ["高二一班", "不加", "88888882", "积攒正能量"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师在大学时期拿到了什么证书，曾经向我们提及？",
    ans: "计算机二级",
    opts: ["计算机二级", "四六级", "教师资格证", "研究生考试"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师的日常用两个字形容是。",
    ans: "拧巴",
    opts: ["糊涂", "通透", "现实", "拧巴"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师与刘刚老师的关系相当于：____",
    ans: "邵新宇老师和贾洁晶老师",
    opts: ["邵新宇老师和贾洁晶老师", "董欣璇老师和王鹤老师", "罗长文老师和洪世松老师", "康沐垚同学和习近平主席"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经历】郑艳军老师念「耗散」这个词时，经典的错误读音是____声。",
    ans: "二",
    opts: ["一", "二", "三", "四"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别咳嗽",
    opts: ["别咳嗽", "别算数", "别睡觉", "别骂人"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别喝水",
    opts: ["别上厕所", "别喝水", "别写作业", "别做眼保健操"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别带情绪",
    opts: ["别带情绪", "别睡觉", "别不学习", "别写物理作业"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经说过哪个以“别”开头的短语？",
    ans: "别太有个性",
    opts: ["别顶嘴", "别说话", "别太有个性", "别骂刘刚老师"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【语录】郑艳军老师曾经问过？",
    ans: "你是不是对我有意见",
    opts: ["上的是正经小学吗", "你是不是对我有意见", "仓鼠？仓鼠是谁？", "同学你的期末目标是什么"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【语录】郑艳军老师曾经问过？",
    ans: "课代表呢？",
    opts: ["课代表呢？", "幼儿园直升高中？", "刘刚是个大废物", "跑操什么时候结束"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【语录】郑艳军老师曾经问过？",
    ans: "你算哪根葱？",
    opts: ["同学你的期末目标一天念多少遍", "没吃过猪还没见过猪跑？", "你算哪根葱？", "以上都不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  }, {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "对我有威胁",
    opts: ["对我有威胁", "厕所有股味", "说学生很爽", "长跑拉风箱"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "红薯味的屁",
    opts: ["刘刚教必胜", "红薯味的屁", "38324", "董欣璇回归"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "都不是",
    opts: ["洞洞幺", "呆呆", "都不是", "亡蜂大汉奸"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经典】下列短语与郑艳军老师相关的是：",
    ans: "别太有个性",
    opts: ["习近平宿敌", "农大高材生", "戒烟防草包", "别太有个性"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经历】郑艳军老师经常对___发号施令：___",
    ans: "陈镜轩；开窗通风",
    opts: ["陈镜轩；开窗通风", "康沐垚；剪头发", "于凯丞；擦黑板", "食堂小孩；别说话"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },  {
    text: "【经历】郑艳军老师经常对___发号施令：___",
    ans: "孟柯；拿手机",
    opts: ["张奥博；别喝水", "孟柯；拿手机", "李庚鉴；别拧巴", "刘刚；别往仪器上涂油"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师经常对___发号施令：___",
    ans: "康沐垚；别发表意见",
    opts: ["康沐垚；别发表意见", "刘泽宏；别抖腿", "董欣璇；别吃虾", "王鹤；别骂人"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语录】郑艳军老师曾经诊断出了：",
    ans: "张奥博肾不好",
    opts: ["张奥博肾不好", "王鹤心理阴暗", "自己活得通透", "王峰不是东西"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语录】郑艳军老师曾经诊断出了：",
    ans: "刘馨桐脑子不好",
    opts: ["张奥博脑子不好", "刘馨桐脑子不好", "张启太脑子不好", "自己脑子不好"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师曾经参与了：",
    ans: "电动牙刷事件",
    opts: ["文化大革命", "电动牙刷事件", "郑艳军刺秦王", "觉醒3000贴吧吧主身份被撤除"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师曾经参与了：",
    ans: "261012食堂被骂事件",
    opts: ["国民党的建立", "刺杀肯尼迪", "261012食堂被骂事件", "化学科目的教学"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【经历】郑艳军老师曾经参与了：",
    ans: "物理学科的教学",
    opts: ["物理学科的教学", "日本首相的任职", "通透教育的贯彻", "以上均不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【捡史】郑艳军老师在2026年10月12日被谁辱骂了",
    ans: "食堂小孩",
    opts: ["食堂小孩", "安倍晋三", "董欣璇", "物理组组长"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【常识】郑艳军老师在周几有区教研",
    ans: "周三",
    opts: ["周一", "周三", "周五", "周日"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【推理】高二1班同学在周几可以按时放学？",
    ans: "周三",
    opts: ["周一", "周三", "周五", "周日"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【捡史】郑艳军老师开学时写过哪四个字？",
    ans: "永远1班",
    opts: ["天下为公", "永远1班", "我缺钱了", "开学快乐"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【名言】郑艳军老师曾经说过哪一句名言？",
    ans: "注意力不集中是精神分裂前兆",
    opts: ["实践是检验真理的唯一标准", "注意力不集中是精神分裂前兆", "我缺钱了，v我五十", "同学们你们的紫金冠歪了"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【名言】郑艳军老师曾经说过哪一句名言？",
    ans: "做眼保健操！",
    opts: ["狗熊哆嗦毛", "做物理作业！", "做眼保健操！", "我最爱我的电动牙刷了"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【读音】郑艳军老师将mgcosθ读作？",
    ans: "ai（二声）mu（四声）zhei（四声）kou（二声）sai（四声）ying（四声）sei（二声）ta（四声）",
    opts: ["ai（二声）mu（四声）zhei（四声）kou（二声）sai（四声）ying（四声）sei（二声）ta（四声）", "ai（二声）mu（四声）zhei（一声）kou（一声）sai（四声）ying（四声）sei（一声）ta（四声）", "ai（二声）mu（四声）ji（四声）kou（二声）sai（四声）ying（四声）sei（二声）ta（四声）", "以上均不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【读音】郑艳军老师将渎职读作？",
    ans: "du（一声）职",
    opts: ["du（三声）职", "du（二声）职", "du（一声）职", "以上均不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【读音】郑艳军老师将陈嘉怡作？",
    ans: "陈嘉欣",
    opts: ["陈嘉怡", "陈嘉欣", "陈镜轩", "以上均不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语法】郑艳军老师用什么形容表扬？",
    ans: "遭到了表扬",
    opts: ["受到了表扬", "遭到了表扬", "被赋予了表扬", "以上均不是"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语法】郑艳军老师经常说人怎么活得怎么样？",
    ans: "通透",
    opts: ["通透", "遭罪", "恶心", "阴暗"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语法】郑艳军老师经常说人怎么活得怎么样？",
    ans: "自私",
    opts: ["神经", "自私", "孤独", "缺爱"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语法】郑艳军老师经常说人怎么活得怎么样？",
    ans: "虚伪",
    opts: ["神经", "认真", "虚伪", "妥协"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },{
    text: "【语法】郑艳军老师经常说人怎么活得怎么样？",
    ans: "自我",
    opts: ["阴间", "傻", "废物", "自我"],
    type: "concept",
    source: "练习册：郑艳军.pdf"
  },
];
