const rosters = {
  "行政班": {
    "1班": ["徐菁泽", "权智洋", "何思涵", "宋欣玥", "延梓源", "路羽辰", "郭樱乔", "姜瑞萱", "陈嘉怡", "王艺冰", "宋振豪", "夏红桢", "延昊成", "邱希芃", "张启太", "康沐垚", "刘佳晨", "李谦睿", "贺敬轩", "崔桐歌", "陈镜轩", "周瀚清", "李硕学", "孟柯", "李思钰", "李庚鉴", "丁奕丹", "李冠成", "刘泽宏", "张珏", "王奕涵", "邢雅茜", "于凯丞", "李米", "方紫洁", "杨紫凝", "严雨菡", "杨思瑞", "段沐昕"],
    "2班": ["张九韬", "谭楚涵", "李思睿", "毛梓墨", "程麟雅", "马泽涵", "陈悦诚", "张逸晨", "项琳", "孙一诚", "张可尧", "王悦嘉", "张新宇", "王海森", "赖若茗", "焦塬贺", "杨佳和", "曹清逸", "门武衡", "刘子源", "赵湛泸", "张家霖", "谢澍兴"],
    "3班": ["阳佳怡", "冯绍轩", "刘岩笑", "任芷墨", "李佑祺", "李子奇", "杨寓淇", "魏际璇", "郭梦萱", "任羽飞", "谭伟轩", "石耘搏", "闫逸航", "贺思源", "黄伟涵", "刘天浩", "苏楷洋", "施沐泽", "李建泽", "付子涵", "宋明轩", "张铠熙", "杜谨成", "万佳仪", "冯思越"],
    "4班": ["熊智皓", "周煦晨", "赵鸣远", "朱笛尔", "李佳瑜", "赵林葳", "康岚", "王安安", "陈天睿", "杨小焜", "李可萱", "王子文", "刘馨桐", "魏宏扬", "常一江", "张奥博", "仝启正", "张宁远", "赵子一"]
  }
};
